[Killed] ConditionalExpression
src/operacoes.js:84:7
   return fibonacci(n - 1) + fibonacci(n - 2);
 }
 function produtoArray(numeros) {
-  if (numeros.length === 0) return 1;
+  if (false) return 1;
   return numeros.reduce((acc, val) => acc * val, 1);
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: Symbol(reduzido)
